In [1]:
from sqlalchemy import create_engine,text
import pandas as pd

engine = create_engine("mysql+pymysql://root:shruti@localhost:3306/pizzahut")

df = pd.read_sql("SELECT * FROM orders;", con=engine)

df.head()

   order_id  order_date      order_time
0         1  2015-01-01 0 days 11:38:36
1         2  2015-01-01 0 days 11:57:40
2         3  2015-01-01 0 days 12:12:28
3         4  2015-01-01 0 days 12:16:31
4         5  2015-01-01 0 days 12:21:30

In [3]:
def run_query(query):
    with engine.connect() as conn:
        result = conn.execute(text(query))
        df = pd.DataFrame(result.fetchall(), columns=result.keys())
    return df

### 1. Retrieve the total number of orders placed.

In [4]:
run_query(""" 

select count(order_id) 'total orders'
from orders;

""")

   total orders
0         21350

### 2. Find the total revenue generated from pizza sales.

In [5]:
run_query("""
    select round(sum(pizzas.price*orders_details.quantity),2) 'total revenue'
from pizzas join orders_details
on pizzas.pizza_id=orders_details.pizza_id;

""")

   total revenue
0      817860.05

### 3. List all unique pizza categories.

In [6]:
run_query("""
     select distinct pizza_types.category
from pizza_types;
""")

  category
0  Chicken
1  Classic
2  Supreme
3   Veggie

### 4. Identify the highest-priced pizza.

In [6]:
run_query("""
     
select pizza_types.name, pizzas.price 
from pizzas join pizza_types
on pizzas.pizza_type_id = pizza_types.pizza_type_id
order by pizzas.price desc
limit 1;

""")

              name  price
0  The Greek Pizza  35.95

### 5. Identify the lowest-priced pizza.

In [7]:
run_query("""
     
select pizza_types.name , pizzas.price
from pizzas join pizza_types
on pizzas.pizza_type_id = pizza_types.pizza_type_id
order by pizzas.price
limit 1;

""")

                  name  price
0  The Pepperoni Pizza   9.75

### 6. Find the most common pizza size ordered.

In [8]:
run_query("""
       select pizzas.size , count(orders_details.order_details_id) 'total_quantity'
from pizzas join orders_details
on pizzas.pizza_id = orders_details.pizza_id
group by pizzas.size
order by total_quantity desc
limit 1;

""")

  size  total_quantity
0    L           18526

### 7. Join pizza tables to show pizza name, size, category, and price together.

In [9]:
run_query("""
     
select pizza_types.name, pizzas.price, pizzas.size, pizza_types.category
from pizza_types join pizzas
on pizza_types.pizza_type_id= pizzas.pizza_type_id;

""")

                                 name  price size category
0          The Barbecue Chicken Pizza  12.75    S  Chicken
1          The Barbecue Chicken Pizza  16.75    M  Chicken
2          The Barbecue Chicken Pizza  20.75    L  Chicken
3        The California Chicken Pizza  12.75    S  Chicken
4        The California Chicken Pizza  16.75    M  Chicken
..                                ...    ...  ...      ...
91         The Spinach and Feta Pizza  16.00    M   Veggie
92         The Spinach and Feta Pizza  20.25    L   Veggie
93  The Vegetables + Vegetables Pizza  12.00    S   Veggie
94  The Vegetables + Vegetables Pizza  16.00    M   Veggie
95  The Vegetables + Vegetables Pizza  20.25    L   Veggie

[96 rows x 4 columns]

### 8. Find the number of orders placed each day.

In [10]:
run_query("""
     
select orders.order_date, count(orders.order_id) 'order_count'
from orders
group by orders.order_date
order by orders.order_date;

""")

     order_date  order_count
0    2015-01-01           69
1    2015-01-02           67
2    2015-01-03           66
3    2015-01-04           52
4    2015-01-05           54
..          ...          ...
353  2015-12-27           35
354  2015-12-28           39
355  2015-12-29           27
356  2015-12-30           32
357  2015-12-31           73

[358 rows x 2 columns]

### 9. Show total pizzas sold (sum of quantity).

In [11]:
run_query("""
   
select sum(orders_details.quantity) 'total_quantity'
from orders_details;

""")

  total_quantity
0          49574

### 10. Retrieve all pizzas along with their price and category.

In [12]:
run_query("""
     
select pizza_types.name,pizza_types.category,pizzas.price
from pizza_types join pizzas
on pizza_types.pizza_type_id = pizzas.pizza_type_id
order by pizza_types.name;

""")

                                 name category  price
0          The Barbecue Chicken Pizza  Chicken  12.75
1          The Barbecue Chicken Pizza  Chicken  16.75
2          The Barbecue Chicken Pizza  Chicken  20.75
3                  The Big Meat Pizza  Classic  12.00
4                  The Big Meat Pizza  Classic  16.00
..                                ...      ...    ...
91             The Thai Chicken Pizza  Chicken  16.75
92             The Thai Chicken Pizza  Chicken  12.75
93  The Vegetables + Vegetables Pizza   Veggie  12.00
94  The Vegetables + Vegetables Pizza   Veggie  16.00
95  The Vegetables + Vegetables Pizza   Veggie  20.25

[96 rows x 3 columns]

### 11. Calculate the total quantity ordered for each pizza.

In [13]:
run_query("""
    
select pizza_types.name, sum(orders_details.quantity)
from orders_details join pizzas
on orders_details.pizza_id = pizzas.pizza_id
join pizza_types 
on pizza_types.pizza_type_id= pizzas.pizza_type_id
group by pizza_types.name;

""")

                                          name sum(orders_details.quantity)
0                           The Hawaiian Pizza                         2422
1                     The Classic Deluxe Pizza                         2453
2                        The Five Cheese Pizza                         1409
3                    The Italian Supreme Pizza                         1884
4                           The Mexicana Pizza                         1484
5                       The Thai Chicken Pizza                         2371
6             The Prosciutto and Arugula Pizza                         1457
7                   The Barbecue Chicken Pizza                         2432
8                              The Greek Pizza                         1420
9                    The Spinach Supreme Pizza                          950
10                      The Green Garden Pizza                          997
11                 The Italian Capocollo Pizza                         1438
12                     The Spicy Italian Pizza                         1924
13                     The Spinach Pesto Pizza                          970
14           The Vegetables + Vegetables Pizza                         1526
15                 The Southwest Chicken Pizza                         1917
16                The California Chicken Pizza                         2370
17                         The Pepperoni Pizza                         2418
18                     The Chicken Pesto Pizza                          973
19                          The Big Meat Pizza                         1914
20                       The Soppressata Pizza                          961
21                       The Four Cheese Pizza                         1902
22                        The Napolitana Pizza                         1464
23                         The Calabrese Pizza                          937
24                The Italian Vegetables Pizza                          981
25                     The Mediterranean Pizza                          934
26                     The Pepper Salami Pizza                         1446
27                  The Spinach and Feta Pizza                         1446
28                          The Sicilian Pizza                         1938
29                   The Chicken Alfredo Pizza                          987
30  The Pepperoni, Mushroom, and Peppers Pizza                         1359
31                        The Brie Carre Pizza                          490

### 12. Determine the distribution of orders by hour of the day.

In [14]:
run_query("""
     
SELECT 
    DATE_FORMAT(order_time, '%h %p') AS order_hour,
    COUNT(order_id) AS order_count
FROM orders
GROUP BY DATE_FORMAT(order_time, '%h %p')
ORDER BY order_hour;

""")

   order_hour  order_count
0       01 PM         2455
1       02 PM         1472
2       03 PM         1468
3       04 PM         1920
4       05 PM         2336
5       06 PM         2399
6       07 PM         2009
7       08 PM         1642
8       09 AM            1
9       09 PM         1198
10      10 AM            8
11      10 PM          663
12      11 AM         1231
13      11 PM           28
14      12 PM         2520

### 13. Calculate revenue generated per pizza type.

In [15]:
run_query("""

    
select pizza_types.name, round(sum(orders_details.quantity*pizzas.price),2) 'revenue_per_pizza'
from orders_details join pizzas
on orders_details.pizza_id=pizzas.pizza_id
join pizza_types
on pizza_types.pizza_type_id=pizzas.pizza_type_id
group by pizza_types.name;

""")

                                          name  revenue_per_pizza
0                           The Hawaiian Pizza           32273.25
1                     The Classic Deluxe Pizza           38180.50
2                        The Five Cheese Pizza           26066.50
3                    The Italian Supreme Pizza           33476.75
4                           The Mexicana Pizza           26780.75
5                       The Thai Chicken Pizza           43434.25
6             The Prosciutto and Arugula Pizza           24193.25
7                   The Barbecue Chicken Pizza           42768.00
8                              The Greek Pizza           28454.10
9                    The Spinach Supreme Pizza           15277.75
10                      The Green Garden Pizza           13955.75
11                 The Italian Capocollo Pizza           25094.00
12                     The Spicy Italian Pizza           34831.25
13                     The Spinach Pesto Pizza           15596.00
14           The Vegetables + Vegetables Pizza           24374.75
15                 The Southwest Chicken Pizza           34705.75
16                The California Chicken Pizza           41409.50
17                         The Pepperoni Pizza           30161.75
18                     The Chicken Pesto Pizza           16701.75
19                          The Big Meat Pizza           22968.00
20                       The Soppressata Pizza           16425.75
21                       The Four Cheese Pizza           32265.70
22                        The Napolitana Pizza           24087.00
23                         The Calabrese Pizza           15934.25
24                The Italian Vegetables Pizza           16019.25
25                     The Mediterranean Pizza           15360.50
26                     The Pepper Salami Pizza           25529.00
27                  The Spinach and Feta Pizza           23271.25
28                          The Sicilian Pizza           30940.50
29                   The Chicken Alfredo Pizza           16900.25
30  The Pepperoni, Mushroom, and Peppers Pizza           18834.50
31                        The Brie Carre Pizza           11588.50

### 14.Calculate total revenue per pizza category.

In [8]:
run_query("""
    
select pizza_types.category, round(sum(orders_details.quantity*pizzas.price),2) 'revenue_per_category'
from orders_details join pizzas
on orders_details.pizza_id= pizzas.pizza_id
join pizza_types 
on pizza_types.pizza_type_id= pizzas.pizza_type_id
group by pizza_types.category;

""")

  category  revenue_per_category
0  Classic             220053.10
1   Veggie             193690.45
2  Supreme             208197.00
3  Chicken             195919.50

### 15.Find the average number of pizzas ordered per day.

In [17]:
run_query("""

     
select orders.order_date, sum(orders_details.quantity)/COUNT(DISTINCT orders.order_id) 'avg_number_pizza'
from orders_details join orders
on orders_details.order_id=orders.order_id
group by orders.order_date
order by orders.order_date;

""")

     order_date avg_number_pizza
0    2015-01-01           2.3478
1    2015-01-02           2.4627
2    2015-01-03           2.3939
3    2015-01-04           2.0385
4    2015-01-05           2.3148
..          ...              ...
353  2015-12-27           2.5429
354  2015-12-28           2.6154
355  2015-12-29           2.9630
356  2015-12-30           2.5625
357  2015-12-31           2.4384

[358 rows x 2 columns]

### 16.Show category-wise number of pizzas sold.

In [9]:
run_query("""
  
select pizza_types.category, sum(orders_details.quantity) 'num_pizza_sold'
from orders_details join pizzas
on orders_details.pizza_id=pizzas.pizza_id
join pizza_types 
on pizza_types.pizza_type_id= pizzas.pizza_type_id
group by pizza_types.category;
""")

  category num_pizza_sold
0  Classic          14888
1   Veggie          11649
2  Supreme          11987
3  Chicken          11050

### 17.List the top 3 pizza sizes ordered by total quantity.

In [10]:
run_query("""

      select pizzas.size,sum(orders_details.quantity) 'Total_quantity'
from orders_details join pizzas
on orders_details.pizza_id = pizzas.pizza_id
group by pizzas.size
order by Total_quantity desc
limit 3;

""")

  size Total_quantity
0    L          18956
1    M          15635
2    S          14403

### 18.Join pizza tables to show pizza name, size, category, and price together.

In [11]:
run_query("""

      select pizza_types.name,pizzas.price,pizzas.size ,pizza_types.category
from pizza_types join pizzas
on pizza_types.pizza_type_id = pizzas.pizza_type_id;

""")

                                 name  price size category
0          The Barbecue Chicken Pizza  12.75    S  Chicken
1          The Barbecue Chicken Pizza  16.75    M  Chicken
2          The Barbecue Chicken Pizza  20.75    L  Chicken
3        The California Chicken Pizza  12.75    S  Chicken
4        The California Chicken Pizza  16.75    M  Chicken
..                                ...    ...  ...      ...
91         The Spinach and Feta Pizza  16.00    M   Veggie
92         The Spinach and Feta Pizza  20.25    L   Veggie
93  The Vegetables + Vegetables Pizza  12.00    S   Veggie
94  The Vegetables + Vegetables Pizza  16.00    M   Veggie
95  The Vegetables + Vegetables Pizza  20.25    L   Veggie

[96 rows x 4 columns]

### 19.Determine the top 3 most ordered pizza types based on revenue.

In [12]:
run_query("""

select  
pizza_types.name ,round(sum(orders_details.quantity * pizzas.price),2) 'revenue_per_pizza_type'
from orders_details join pizzas
on orders_details.pizza_id = pizzas.pizza_id
join pizza_types 
on pizza_types.pizza_type_id = pizzas.pizza_type_id
group by pizza_types.name
order by revenue_per_pizza_type desc
limit 3;

""")

                           name  revenue_per_pizza_type
0        The Thai Chicken Pizza                43434.25
1    The Barbecue Chicken Pizza                42768.00
2  The California Chicken Pizza                41409.50

### 20. Find the day with the highest number of orders.

In [13]:
run_query("""
      select orders.order_date, count(orders_details.order_id) 'num_orders'
from orders join orders_details
on orders.order_id = orders_details.order_id
group by orders.order_date 
order by num_orders desc
limit 1;

""")

   order_date  num_orders
0  2015-11-26         261

### 21.Identify the pizza that generated the highest revenue.

In [23]:
run_query("""

      select pizza_types.name, round(sum(orders_details.quantity * pizzas.price),2) 'revenue'
from orders_details join pizzas
on orders_details.pizza_id = pizzas.pizza_id
join pizza_types 
on pizza_types.pizza_type_id = pizzas.pizza_type_id
group by pizza_types.name
order by revenue desc
limit 1;
""")

                     name   revenue
0  The Thai Chicken Pizza  43434.25

### 22.Find monthly revenue trends.

In [14]:
run_query("""
       select month(orders.order_date) 'month_no', 
monthname(orders.order_date) 'month_name', 
round(sum(orders_details.quantity * pizzas.price),2) 'rev'
from orders_details join pizzas
on orders_details.pizza_id = pizzas.pizza_id
join orders
on orders.order_id = orders_details.order_id
group by month_no, month_name
order by month_no;

""")

    month_no month_name       rev
0          1    January  69793.30
1          2   February  65159.60
2          3      March  70397.10
3          4      April  68736.80
4          5        May  71402.75
5          6       June  68230.20
6          7       July  72557.90
7          8     August  68278.25
8          9  September  64180.05
9         10    October  64027.60
10        11   November  70395.35
11        12   December  64701.15

### 23. Calculate the percentage contribution of each pizza category to total revenue.

In [29]:
run_query("""
        SELECT 
    pt.category,
    ROUND(
        SUM(od.quantity * p.price) 
        /
        (SELECT SUM(od2.quantity * p2.price)
         FROM orders_details od2
         JOIN pizzas p2 
            ON od2.pizza_id = p2.pizza_id
        ) * 100,
    2) AS percentage_contribution
FROM orders_details od
JOIN pizzas p 
    ON od.pizza_id = p.pizza_id
JOIN pizza_types pt 
    ON p.pizza_type_id = pt.pizza_type_id
GROUP BY pt.category
ORDER BY percentage_contribution DESC;

""")

  category  percentage_contribution
0  Classic                    26.91
1  Supreme                    25.46
2  Chicken                    23.96
3   Veggie                    23.68

### 24. Create a cumulative revenue report over time.

In [15]:
run_query("""
        SELECT 
    o.order_date,
    SUM(od.quantity * p.price) AS daily_revenue,
    SUM(SUM(od.quantity * p.price)) 
        OVER (ORDER BY o.order_date) AS cumulative_revenue
FROM orders o
JOIN orders_details od 
    ON o.order_id = od.order_id
JOIN pizzas p 
    ON od.pizza_id = p.pizza_id
GROUP BY o.order_date
ORDER BY o.order_date;

""")

     order_date  daily_revenue  cumulative_revenue
0    2015-01-01        2713.85             2713.85
1    2015-01-02        2731.90             5445.75
2    2015-01-03        2662.40             8108.15
3    2015-01-04        1755.45             9863.60
4    2015-01-05        2065.95            11929.55
..          ...            ...                 ...
353  2015-12-27        1419.00           810615.80
354  2015-12-28        1637.20           812253.00
355  2015-12-29        1353.25           813606.25
356  2015-12-30        1337.80           814944.05
357  2015-12-31        2916.00           817860.05

[358 rows x 3 columns]

### 25. Find the most ordered pizza in each category.

In [41]:
run_query("""
      SELECT 
    category,
    name AS pizza_name,
    total_quantity
FROM (
    SELECT 
        pt.category,
        pt.name,
        SUM(od.quantity) AS total_quantity,
        RANK() OVER (
            PARTITION BY pt.category 
            ORDER BY SUM(od.quantity) DESC
        ) AS rnk
    FROM orders_details od
    JOIN pizzas p 
        ON od.pizza_id = p.pizza_id
    JOIN pizza_types pt 
        ON p.pizza_type_id = pt.pizza_type_id
    GROUP BY pt.category, pt.name
) t
WHERE rnk = 1;

""")

  category                  pizza_name total_quantity
0  Chicken  The Barbecue Chicken Pizza           2432
1  Classic    The Classic Deluxe Pizza           2453
2  Supreme          The Sicilian Pizza           1938
3   Veggie       The Four Cheese Pizza           1902

### 26. Determine the top 3 pizzas by revenue in each category.

In [42]:
run_query("""
      SELECT 
    category,
    pizza_name,
    total_revenue
FROM (
    SELECT 
        pt.category,
        pt.name AS pizza_name,
        SUM(od.quantity * p.price) AS total_revenue,
        DENSE_RANK() OVER (
            PARTITION BY pt.category 
            ORDER BY SUM(od.quantity * p.price) DESC
        ) AS rnk
    FROM orders_details od
    JOIN pizzas p 
        ON od.pizza_id = p.pizza_id
    JOIN pizza_types pt 
        ON p.pizza_type_id = pt.pizza_type_id
    GROUP BY pt.category, pt.name
) t
WHERE rnk <= 3
ORDER BY category, rnk;

""")

   category                    pizza_name  total_revenue
0   Chicken        The Thai Chicken Pizza       43434.25
1   Chicken    The Barbecue Chicken Pizza       42768.00
2   Chicken  The California Chicken Pizza       41409.50
3   Classic      The Classic Deluxe Pizza       38180.50
4   Classic            The Hawaiian Pizza       32273.25
5   Classic           The Pepperoni Pizza       30161.75
6   Supreme       The Spicy Italian Pizza       34831.25
7   Supreme     The Italian Supreme Pizza       33476.75
8   Supreme            The Sicilian Pizza       30940.50
9    Veggie         The Four Cheese Pizza       32265.70
10   Veggie            The Mexicana Pizza       26780.75
11   Veggie         The Five Cheese Pizza       26066.50

### 27. Analyze sales patterns by weekday vs weekend.

In [43]:
run_query("""
      SELECT 
    CASE 
        WHEN DAYOFWEEK(o.order_date) IN (1,7) 
            THEN 'Weekend'
        ELSE 'Weekday'
    END AS day_type,
    COUNT(DISTINCT o.order_id) AS total_orders,
    SUM(od.quantity) AS total_pizzas_sold,
    SUM(od.quantity * p.price) AS total_revenue
FROM orders o
JOIN orders_details od 
    ON o.order_id = od.order_id
JOIN pizzas p 
    ON od.pizza_id = p.pizza_id
GROUP BY day_type;

""")

  day_type  total_orders total_pizzas_sold  total_revenue
0  Weekday         15568             36046      595474.15
1  Weekend          5782             13528      222385.90

### 28. Find the average order value (AOV).

In [16]:
run_query("""
      SELECT 
    ROUND(
        SUM(od.quantity * p.price) / COUNT(DISTINCT o.order_id),
    2) AS average_order_value
FROM orders o
JOIN orders_details od 
    ON o.order_id = od.order_id
JOIN pizzas p 
    ON od.pizza_id = p.pizza_id;

""")

   average_order_value
0                38.31

### 29. Determine which pizza size generates the most revenue.

In [17]:
run_query("""
      SELECT 
    p.size,
    SUM(od.quantity * p.price) AS total_revenue
FROM orders_details od
JOIN pizzas p 
    ON od.pizza_id = p.pizza_id
GROUP BY p.size
ORDER BY total_revenue DESC
LIMIT 1;


""")

  size  total_revenue
0    L       375318.7